[{"n":"01","id":"nadizar2021effects","title":"On the Effects of Pruning on Evolved Neural Controllers for Soft Robots","author":"G. Nadizar, E. Medvet, F.A. Pellegrino, M. Zullich, S. Nichele","venue":"Workshop on Neuroevolution at Work (NEWK@GECCO)","year":"2021","type":"conference","doi":"10.1145/3449726.3463161","full_text":"https://drive.google.com/file/d/1icWdoHdqNieFerpcTlQooeMb0t_KDW8n/view","slides":"https://drive.google.com/file/d/1_O4JkHlWHfXFkOw5c1jkVg5050Un43CU/view","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2021effects,\n  title={{On the effects of pruning on evolved neural controllers for soft robots}},\n  author={Nadizar, Giorgia and Medvet, Eric and Pellegrino, Felice Andrea and Zullich, Marco and Nichele, Stefano},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference Companion}},\n  pages={1744--1752},\n  year={2021},\n  doi={10.1145/3449726.3463161},\n  keywords={workshop}\n}","abstract":"Artificial neural networks (ANNs) are commonly used for controlling robotic agents. For robots with many sensors and actuators, ANNs can be very complex, with many neurons and connections. Removal of neurons or connections, i.e., pruning, may be desirable because (i) it reduces the complexity of the ANN, making its operation more energy efficient, and (ii) it might improve the generalization ability of the ANN. Whether these goals can actually be achieved in practice is however still not well known. On the other hand, it is widely recognized that pruning in biological neural networks plays a fundamental role in the development of brains and their ability to learn. In this work, we consider the case of Voxel-based Soft Robots, a kind of robots where sensors and actuators are distributed over the body and that can be controlled with ANNs optimized by means of neuroevolution. We experimentally characterize the effect of different forms of pruning on the effectiveness of neuroevolution, also in terms of generalization ability of the evolved ANNs. We find that, with some forms of pruning, a large portion of the connections can be pruned without strongly affecting robot capabilities. We also observe sporadic improvements in generalization ability."},{"n":"02","id":"nadizar2022merging","title":"Merging Pruning and Neuroevolution: towards Robust and Efficient Controllers for Modular Soft Robots","author":"G. Nadizar, E. Medvet, S. Nichele, O. Huse Ramstad, F.A. Pellegrino, M. Zullich","venue":"Knowledge Engineering Review (KER)","year":"2022","type":"journal","doi":"10.1017/S0269888921000151","full_text":"https://drive.google.com/file/d/1vDBESobcKRld9-RJ103IFY86aQTzR6az/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{nadizar2022merging,\n  title={{Merging pruning and neuroevolution: towards robust and efficient controllers for modular soft robots}},\n  author={Nadizar, Giorgia and Medvet, Eric and Ramstad, Ola Huse and Nichele, Stefano and Pellegrino, Felice Andrea and Zullich, Marco},\n  journal={{The Knowledge Engineering Review}},\n  volume={37},\n  year={2022},\n  publisher={Cambridge University Press},\n  doi={10.1017/S0269888921000151}\n}","abstract":"Artificial neural networks (ANNs) can be employed as controllers for robotic agents. Their structure is often complex, with many neurons and connections, especially when the robots have many sensors and actuators distributed across their bodies and/or when high expressive power is desirable. Pruning (removing neurons or connections) reduces the complexity of the ANN, thus increasing its energy efficiency, and has been reported to improve the generalization capability, in some cases. In addition, it is well-known that pruning in biological neural networks plays a fundamental role in the development of brains and their ability to learn. In this work, we consider the evolutionary optimization of neural controllers for the case study of Voxel-based Soft Robots, a kind of modular, bio-inspired soft robots, applying pruning during fitness evaluation. For a locomotion task, and for centralized as well as distributed controllers, we experimentally characterize the effect of different forms of pruning on after-pruning effectiveness, life-long effectiveness, adaptability to new terrains, and behavior. We find that incorporating some forms of pruning in neuroevolution leads to almost equally effective controllers as those evolved without pruning, with the benefit of higher robustness to pruning. We also observe occasional improvements in generalization ability."},{"n":"03","id":"nadizar2022schedule","title":"On the Schedule for Morphological Development of Evolved Modular Soft Robots","author":"G. Nadizar, E. Medvet, K. Miras","venue":"25th European Conference on Genetic Programming (EuroGP)","year":"2022","type":"conference","doi":"10.1007/978-3-031-02056-8_10","full_text":"https://drive.google.com/file/d/194p4oxXWCE4J2xPrqhQTdmr0PSUx8q17/view","slides":"https://drive.google.com/file/d/1q0s9kFoHl_TqrMP_aNOuGCoyqz7Skwm0/view","video":"https://www.youtube.com/watch?v=DD4D20EH1sA&ab_channel=EricMedvet","notes":"Best student poster award","code":"https://github.com/giorgia-nadizar/VSREvoDevo","poster":"https://drive.google.com/file/d/1u53reNhuMiIyDYJLCl4d6VIwm86xDxHT/view","cite":"@inproceedings{nadizar2022schedule,\n  title={{On the Schedule for Morphological Development of Evolved Modular Soft Robots}},\n  author={Nadizar, Giorgia and Medvet, Eric and Miras, Karine},\n  booktitle={{European Conference on Genetic Programming (Part of EvoStar)}},\n  pages={146--161},\n  year={2022},\n  organization={Springer},\n  doi={10.1007/978-3-031-02056-8_10}\n}","abstract":"Development is fundamental for living beings. As robots are often designed to mimic biological organisms, development is believed to be crucial for achieving successful results in robotic agents, as well. What is not clear, though, is the most appropriate scheduling for development. While in real life systems development happens mostly during the initial growth phase of organisms, it has not yet been investigated whether such assumption holds also for artificial creatures. In this paper, we employ a evolutionary approach to optimize the development—according to different representations—of Voxel-based Soft Robots (VSRs), a kind of modular robots. In our study, development consists in the addition of new voxels to the VSR, at fixed time instants, depending on the development schedule. We experiment with different schedules and show that, similarly to living organisms, artificial agents benefit from development occurring at early stages of life more than from development lasting for their entire life."},{"n":"04","id":"nadizar2022collective","title":"Collective control of modular soft robots via embodied Spiking Neural Cellular Automata","author":"G. Nadizar, E. Medvet, S. Nichele, S. Pontes-Filho","venue":"Workshop on From Cells to Societies: Collective Learning across Scales (Cells2Societies@ICLR)","year":"2022","type":"conference","doi":"10.48550/arXiv.2204.02099","full_text":"https://drive.google.com/file/d/1wpkgmOICi0DFoIxf30HoBU17ILP_DQ_b/view","slides":"https://drive.google.com/file/d/12cW5C4j68NP_0NfOqLXaUjlDrjZHf-mK/view","video":"https://giorgia-nadizar.github.io/VSRCollectiveControlViaSNCA/","notes":"Best poster award","code":"https://github.com/giorgia-nadizar/VSRCollectiveControlViaSNCA","poster":"https://drive.google.com/file/d/1VRjFTHKsaqGpg05WCluQTfLlcPsAXPlz/view","cite":"@inproceedings{nadizar2022collective,\n  title={{Collective control of modular soft robots via embodied Spiking Neural Cellular Automata}},\n  author={Nadizar, Giorgia and Medvet, Eric and Nichele, Stefano and Pontes-Filho, Sidney},\n  booktitle={{Workshop on From Cells to Societies: Collective Learning across Scales (Part of ICLR)}},\n  year={2022},\n  keywords={local}\n}","abstract":"Voxel-based Soft Robots (VSRs) are a form of modular soft robots, composed of several deformable cubes, i.e., voxels. Each VSR is thus an ensemble of simple agents, namely the voxels, which must cooperate to give rise to the overall VSR behavior. Within this paradigm, collective intelligence plays a key role in enabling the emerge of coordination, as each voxel is independently controlled, exploiting only the local sensory information together with some knowledge passed from its direct neighbors (distributed or collective control). In this work, we propose a novel form of collective control, influenced by Neural Cellular Automata (NCA) and based on the bio-inspired Spiking Neural Networks: the embodied Spiking NCA (SNCA). We experiment with different variants of SNCA, and find them to be competitive with the state-of-the-art distributed controllers for the task of locomotion. In addition, our findings show significant improvement with respect to the baseline in terms of adaptability to unforeseen environmental changes, which could be a determining factor for physical practicability of VSRs."},{"n":"05","id":"medvet2022jgea","title":"JGEA: a Modular Java Framework for Experimenting with Evolutionary Computation","author":"E. Medvet, G. Nadizar, L. Manzoni","venue":"Workshop Evolutionary Computation Software Systems (EvoSoft@GECCO)","year":"2022","type":"conference","doi":"10.1145/3520304.3533960","full_text":"https://drive.google.com/file/d/1wZ-B5lh2U4BWqmJiJhSu8KMm5SH-Ll8v/view","slides":"https://giorgia-nadizar.github.io/slides/JGEA","video":"","notes":"","code":"https://github.com/ericmedvet/jgea","poster":"","cite":"@inproceedings{medvet2022jgea,\n  title={{JGEA: a modular java framework for experimenting with evolutionary computation}},\n  author={Medvet, Eric and Nadizar, Giorgia and Manzoni, Luca},\n  booktitle={{Proceedings of the genetic and evolutionary computation conference companion}},\n  pages={2009--2018},\n  year={2022},\n  keywords={workshop},\n  doi={10.1145/3520304.3533960}\n}","abstract":"We present the Java General Evolutionary Algorithm (JGEA) framework, a modular Java framework for experimenting with Evolutionary Computation (EC). We designed JGEA to be (a) aimed at providing a general interface to potentially all Evolutionary Algorithms (EAs), yet (b) solid and easy to use for people who rely on EC as a tool. To this extent, we developed JGEA including a range of ready-to-use EAs, backed by a modular architecture, comprising diverse layers of abstraction, which simplifies the implementation of new EAs and the addition of new features. Here, we detail the general structure of JGEA, focusing on its high-level components, and present the use case of the introduction of a new EA in the framework. To complete the picture, we illustrate the application of JGEA for solving a real world problem, from its formal definition in the framework to the saving and processing of results. The source code of JGEA is available at <a href=\"https://github.com/ericmedvet/jgea\">https://github.com/ericmedvet/jgea</a>."},{"n":"06","id":"medvet2022impact","title":"On the Impact of Body Material Properties on Neuroevolution for Embodied Agents: the Case of Voxel-based Soft Robots","author":"E. Medvet, G. Nadizar, F. Pigozzi","venue":"Workshop on Neuroevolution at Work (NEWK@GECCO)","year":"2022","type":"conference","doi":"10.1145/3520304.3533967","full_text":"https://drive.google.com/file/d/1Y3dQGibLWLsFE50UcwP58AOH4b79vCnu/view","slides":"https://drive.google.com/file/d/1SuhqjgEJqNYOsPkMMwdFnLgoWBAPl9pj/view","video":"https://giorgia-nadizar.github.io/BodyParamsInfluenceOnNE/","notes":"","code":"https://github.com/giorgia-nadizar/BodyParamsInfluenceOnNE","poster":"","cite":"@inproceedings{medvet2022impact,\n  title={{On the impact of body material properties on neuroevolution for embodied agents: the case of voxel-based soft robots}},\n  author={Medvet, Eric and Nadizar, Giorgia and Pigozzi, Federico},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference Companion}},\n  pages={2122--2130},\n  year={2022},\n  keywords={workshop},\n  doi={10.1145/3520304.3533967}\n}","abstract":"Artificial agents required to perform non-trivial tasks are commonly controlled with Artificial Neural Networks (ANNs), which need to be carefully fine-tuned. This is where ANN optimization comes into play, often in the form of Neuroevolution (NE). Among artificial agents, the <i>embodied</i> ones are characterized by a strong body-brain entanglement, i.e., a strong interdependence between the physical properties of the body and the controller. In this work, we aim at characterizing said interconnection, experimentally evaluating the impact body material properties have on NE for embodied agents. We consider the case of Voxel-based Soft Robots (VSRs), a class of simulated modular soft robots which achieve movement through the rhythmical contraction and expansion of their modules. We experiment varying several physical properties of VSRs and assess the effectiveness of the evolved controllers for the task of locomotion, together with their robustness and adaptability. Our results confirm the existence of a deep body-brain interrelationship for embodied agents, and highlight how NE fruitfully exploits the physical properties of the agents to give rise to a wide gamut of effective and adaptable behaviors."},{"n":"07","id":"furlan2022mutual","title":"On the Mutual Influence of Human and Artificial Life: an Experimental Investigation","author":"S. Furlan, E. Medvet, G. Nadizar, F. Pigozzi","venue":"Conference on Artificial Life (Alife)","year":"2022","type":"conference","doi":"10.1162/isal_a_00492","full_text":"https://drive.google.com/file/d/1PQUzf6eC2Kdn9R67NCbWw3bdr2uC4uBG/view","slides":"https://giorgia-nadizar.github.io/slides/HumanALifeMutualInfluence","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{furlan2022mutual,\n  title={{On the Mutual Influence of Human and Artificial Life: an Experimental Investigation}},\n  author={Furlan, Stefano and Medvet, Eric and Nadizar, Giorgia and Pigozzi, Federico},\n  booktitle={{ALIFE 2022: The 2022 Conference on Artificial Life}},\n  year={2022},\n  organization={MIT press},\n  doi={10.1162/isal_a_00492}\n}","abstract":"Our modern world is teeming with non-biological agents, whose growing complexity brings them so close to living beings that they can be cataloged as artificial <i>creatures</i>, i.e., a form of Artificial Life (ALife). Ranging from disembodied intelligent agents to robots of conspicuous dimensions, all these artifacts are united by the fact that they are designed, built, and possibly trained by humans taking inspiration from natural elements. Hence, humans play a fundamental role in relation to ALife, both as creators and as final users, which calls attention to the need of studying the mutual influence of human and artificial life. Here we attempt an experimental investigation of the reciprocal effects of the human-ALife interaction. To this extent, we design an artificial world populated by life-like creatures, and resort to open-ended evolution to foster the creatures adaptation. We allow bidirectional communication between the system and humans, who can observe the artificial world and voluntarily choose to perform positive or negative actions towards the creatures populating it; those actions may have a short- or long-term impact on the artificial creatures. Our experimental results show that the creatures are capable of evolving under the influence of humans, even though the impact of the interaction remains uncertain. In addition, we find that ALife gives rise to disparate feelings in humans who interact with it, who are not always aware of the importance of their conduct."},{"n":"08","id":"nadizar2022p","title":"P Systems inference via Grammatical Evolution","author":"G. Nadizar, G. Pietropolli","venue":"23rd Conference on Membrane Computing (CMC)","year":"2022","type":"conference","doi":"","full_text":"https://drive.google.com/file/d/11E9Srh4myYl5YvszJCy__lLKmKZZFTX7/view","slides":"https://drive.google.com/file/d/1T52TuNgKtSJznhSfZKgI_EXK9zHq9ec-/view?usp=sharing","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2022p,\n  title={{P Systems inference via Grammatical Evolution}},\n  author={Nadizar, Giorgia and Pietropolli, Gloria},\n  booktitle={{23rd Conference on Membrane Computing (CMC)}},\n  year={2022},\n  keywords={local}\n}","abstract":"P systems are a bio-inspired framework for defining parallel models of computation. Despite their relevance for both theoretical and application scenarios, the design and synthesis of P systems remain a tedious and demanding task. In this work, we try to address this problem by proposing an automated design methodology based on Grammatical Evolution (GE)—an evolutionary computation technique. We consider a situation where observations of the steps of a P system are available, and we rely on GE for automatically inferring its structure, i.e., its rules."},{"n":"09","id":"nadizar2023effects","title":"On the Effects of Collaborators Selection and Aggregation in Cooperative Coevolution: an Experimental Analysis","author":"G. Nadizar, E. Medvet","venue":"26th European Conference on Genetic Programming (EuroGP)","year":"2023","type":"conference","doi":"10.1007/978-3-031-29573-7_19","full_text":"https://drive.google.com/file/d/1utQ5kCukMH61jR5f8evADBdl6L1CE8gD/view","slides":"https://drive.google.com/file/d/14wo-NW1gaYiHUPMIhkb-Ap4ICvOnWCSS/view","video":"","notes":"","code":"","poster":"https://drive.google.com/file/d/1-1SPyLVSgyT9m2Loqj_vCSwNLjZUjMYD/view","cite":"@inproceedings{nadizar2023effects,\n  title={{On the Effects of Collaborators Selection and Aggregation in Cooperative Coevolution: An Experimental Analysis}},\n  author={Nadizar, Giorgia and Medvet, Eric},\n  booktitle={{Genetic Programming: 26th European Conference, EuroGP 2023, Held as Part of EvoStar 2023, Brno, Czech Republic, April 12--14, 2023, Proceedings}},\n  pages={292--307},\n  year={2023},\n  organization={Springer},\n  doi={10.1007/978-3-031-29573-7_19}\n}","abstract":"Cooperative Coevolution is a way to solve complex optimization problems by dividing them in smaller, simpler sub-problems. Those sub-problems are then tackled concurrently by evolving one population of solutions—actually, <i>components</i> of a larger solution—for each of them. However, components cannot be evaluated in isolation: in the common case of two concurrently evolving populations, each solution of one population must be coupled with another solution of the other population (the <i>collaborator</i>) in order to compute the fitness of the pair. Previous studies have already shown that the way collaborators are chosen and, if more than one is chosen, the way the resulting fitness measures are aggregated, play a key role in determining the success of coevolution. In this paper we perform an experimental analysis aimed at shedding new light on the effects of collaborators selection and aggregation. We first propose a general scheme for cooperative coevolution of two populations that allows to (a) different EAs and solution representations on the two sub-problems and to (b) set different collaborators selection and aggregation strategies. Second, we instantiate this general scheme in a few variants and apply it to four optimization problems with different degrees of separability: two toy problems and two real prediction problems tackled with different kinds of model (symbolic regression and neural networks). We analyze the outcomes in terms of (a) effectiveness and efficiency of the optimization and (b) complexity and generalization power of the solutions. We find that the degree to which selection and aggregation schemes differ strongly depends on the interaction between the components of the solution."},{"n":"10","id":"nadizar2023investigation","title":"An Investigation of Geometric Semantic GP with Linear Scaling","author":"G. Nadizar, F. Garrow, B. Sakallioglu, L. Canonne, S. Silva, L. Vanneschi","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2023","type":"conference","doi":"10.1145/3583131.3590418","full_text":"https://drive.google.com/file/d/1-wudemZ9qlh2JuGdhdA_2DujtptIyR46/view","slides":"https://drive.google.com/file/d/1mZYfZtwILgSrSZAYMtXMrGL6cG85RoOw/view","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2023investigation,\n  title={{An Investigation of Geometric Semantic GP with Linear Scaling}},\n  author={Nadizar, Giorgia and Garrow, Fraser and Sakallioglu, Berfin and Canonne, Lorenzo and Silva, Sara and Vanneschi, Leonardo},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference}},\n  pages={1165--1174},\n  year={2023},\n  doi={10.1145/3583131.3590418}\n}","abstract":"Geometric semantic genetic programming (GSGP) and linear scaling (LS) have both, independently, shown the ability to outperform standard genetic programming (GP) for symbolic regression. GSGP uses geometric semantic genetic operators, different from the standard ones, without altering the fitness, while LS modifies the fitness without altering the genetic operators. So far, these two methods have already been joined together in only one practical application. However, to the best of our knowledge, a methodological study on the pros and cons of integrating these two methods has never been performed. In this paper, we present a study of GSGP-LS, a system that integrates GSGP and LS. The results, obtained on five hand-tailored benchmarks and six real-life problems, indicate that GSGP-LS outperforms GSGP in the majority of the cases, confirming the expected benefit of this integration. However, for some particularly hard datasets, GSGP-LS overfits training data, being outperformed by GSGP on unseen data. Additional experiments using standard GP, with and without LS, confirm this trend also when standard crossover and mutation are employed. This contradicts the idea that LS is always beneficial for GP, warning the practitioners about its risk of overfitting in some specific cases."},{"n":"11","id":"nadizar2023fully","title":"A Fully-distributed Shape-aware Neural Controller for Modular Robots","author":"G. Nadizar, E. Medvet, K. Walker, S. Risi","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2023","type":"conference","doi":"10.1145/3583131.3590419","full_text":"https://drive.google.com/file/d/1qpA7IpTJS881gjvu0kYHmkr5XraCZB28/view","slides":"https://drive.google.com/file/d/1Cps3JFwQx-p9emQr9rAbjJkBv-xq_2BX/view","video":"https://drive.google.com/drive/u/1/folders/12t2Wt07PzQCRFTkeEwCi4rK_71F9S650","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2023fully,\n  title={{A fully-distributed shape-aware neural controller for modular robots}},\n  author={Nadizar, Giorgia and Medvet, Eric and Walker, Kathryn and Risi, Sebastian},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference}},\n  pages={184--192},\n  year={2023},\n  doi={10.1145/3583131.3590419}\n}","abstract":"Modular robots are promising for their versatility and large design freedom. Modularity can also enable automatic assembly and reconfiguration, be it autonomous or via external machinery. However, these procedures are error-prone and often result in misassemblings. This, in turn, can cause catastrophic effects on the robot functionality, as the controller deployed in each module is optimized for a different robot shape than the actual one. In this work, we address such shortcoming by proposing a shape-aware modular controller, operating with (1) <i>self-discovery</i> phase, in which each module controller identifies the shape it is assembled in, followed by (2) <i>parameter selection</i> phase, where the controller selects its parameters according to the inferred shape. We deploy a self-classifying neural cellular automaton for phase (1), and we leverage evolutionary optimization for implementing a library of controller parameters for phase (2). We test the validity of the proposed method considering voxel-based soft robots, a class of modular soft robots, and the task of locomotion. Our findings confirm the effectiveness of such a controller paradigm, and also show that it can be used to partially overcome unforeseen damages or assembly mistakes."},{"n":"12","id":"medvet2023gp","title":"GP for Continuous Control: Teacher or Learner? The Case of Simulated Modular Soft Robots","author":"E. Medvet, G. Nadizar","venue":"XX Genetic Programming Theory & Practice (GPTP)","year":"2023","type":"chapter","doi":"10.1007/978-981-99-8413-8_11","full_text":"https://drive.google.com/file/d/1sxsxIg2DoE05JqSdzqS6alubSQ_XST0p/view","slides":"https://medvet.inginf.units.it/slides/2023-gptp-gp-continuous-control-imitation/#1","video":"","notes":"","code":"","poster":"","cite":"@incollection{medvet2024gp,\n  title={{GP for Continuous Control: Teacher or Learner? The Case of Simulated Modular Soft Robots}},\n  author={Medvet, Eric and Nadizar, Giorgia},\n  booktitle={{Genetic Programming Theory and Practice XX}},\n  pages={203--224},\n  year={2024},\n  publisher={Springer},\n  doi={10.1007/978-981-99-8413-8_11}\n}","abstract":"We consider the problem of optimizing a controller for agents whose observation and action spaces are continuous, i.e., where the controller is a multivariate real function f: R^n → R^m. We use genetic programming (GP) for solving this optimization problem. Namely, we employ a multi-tree-based GP variant, where a candidate solution is an array of m trees, each encoding a univariate function of the agent observation. We compare this form of optimization against the more common one where the controller is a multi-layer perceptron, with a predefined topology, whose weights are optimized through (neuro)evolution (NE). Moreover, we consider an evolutionary algorithm, GraphEA, that directly evolves graphs, each having n input nodes and m output nodes. We apply these three approaches to the case of simulated modular soft robots, where a robot is an aggregation of identical soft modules, each employing a controller that processes the local observation and produces the local action. We find that, in our scenario, multi-tree-based GP is competitive with NE and tends to produce different behaviors. We then experimentally investigate the possibility of optimizing a controller using another, pre-optimized one, as teacher, i.e., we realize a form of offline imitation learning. We consider all the teacher-learner pairs resulting from the three evolutionary algorithms and find that NE is a better learner than GP and GraphEA. However, controllers obtained through offline imitation learning are far less effective than those obtained through direct evolution. We hypothesize that this gap in effectiveness may be explained by the possibility, given by direct evolution, of exploring during the simulations a larger portion of the observation-action space."},{"n":"13","id":"nadizar2023neural","title":"Neural Cellular Automata Enable Self-Discovery of Physical Configuration in Modular Robots Driven by Collective Intelligence","author":"G. Nadizar, E. Medvet, K. Walker, S. Risi","venue":"The Distributed Ghost Workshop (DistributedGhost@Alife)","year":"2023","type":"conference","doi":"","full_text":"https://drive.google.com/file/d/1uJw-zGPvNjTW6I3p000X3iwW4sQwgiVe/view","slides":"https://drive.google.com/file/d/1olJJXto8e8k9YokVoAzs4oTiV_l8TCu9/view","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2023neural,\n  title={{Neural Cellular Automata Enable Self-Discovery of Physical Configuration in Modular Robots Driven by Collective Intelligence}},\n  author={Nadizar, Giorgia and Medvet, Eric and Walker, Kathryn and Risi, Sebastian},\n  booktitle={{Proceedings of the Distributed Ghost Workshop of the Artificial Life Conference}},\n  pages={1--3},\n  year={2023},\n  keywords={local}\n}","abstract":"Modular robots are capable of self-assembly and reconfiguration, allowing them to adapt to changing environmental conditions and perform complex tasks. However, these robots typically require controllers that are optimized for their specific shape and intended function. In the event of an assembly failure, even minor discrepancies can lead to significant problems because the controller is designed to operate in a specific scenario. To address this issue, we propose a shape-aware embodied controller that relies on self-discovery driven by Neural Cellular Automata (NCA), which enables the system to identify its own configuration, followed by the selection of the appropriate controller, from a library of pre-trained ones, and its deployment in response to the current situation. As a result, our controller is designed to be able to adapt to unforeseen errors and even damages and continue to operate effectively even in the face of unexpected circumstances."},{"n":"14","id":"nadizar2023experimental","title":"An Experimental Comparison of Evolved Neural Network Models for Controlling Simulated Modular Soft Robots","author":"G. Nadizar, E. Medvet, S. Nichele, S. Pontes-Filho","venue":"Applied Soft Computing (ASOC)","year":"2023","type":"journal","doi":"10.1016/j.asoc.2023.110610","full_text":"https://drive.google.com/file/d/1mmH_y8jNppigIMGXO7x2A_5V3-VZmc7a/view","slides":"","video":"https://giorgia-nadizar.github.io/NeuralModelsVSR/","notes":"","code":"https://github.com/giorgia-nadizar/NeuralModelsVSR","poster":"","cite":"@article{nadizar2023experimental,\n  title={{An experimental comparison of evolved neural network models for controlling simulated modular soft robots}},\n  author={Nadizar, Giorgia and Medvet, Eric and Nichele, Stefano and Pontes-Filho, Sidney},\n  journal={{Applied Soft Computing}},\n  pages={110610},\n  year={2023},\n  publisher={Elsevier},\n  doi={10.1016/j.asoc.2023.110610}\n}","abstract":"Voxel-based soft robots (VSRs) are a type of modular robots composed by interconnected soft and deformable blocks, i.e., voxels. Thanks to the softness of their bodies, VSRs may exhibit rich dynamic behaviors. One open question is what type of neural controller is most suitable for a given morphology and sensory apparatus in a given environment. One observation is that artificial neural networks with state may be able to cope with the dynamical nature of VSR bodies and their morphological computation. In this work, we consider four types of controllers, i.e., multilayer perceptrons (MLPs, stateless), recurrent neural networks (RNNs), spiking neural networks (SNNs) without homeostasis, and SNNs with homeostasis. We consider three robot morphologies tested for locomotion, where each morphology is investigated in simulation with three different types and number of sensors. Neural network controllers are optimized with neuroevolution, and the experimental results are compared in terms of effectiveness, efficiency, and generalization ability. In addition, we analyze the resulting behavior of the robots systematically. Our results show that RNNs are typically more effective while MLPs are often the weakest controllers, particularly for robots with few sensors. However, SNNs are more capable in terms of generalization and the mechanism of homeostasis is often beneficial. Finally, we show that RNNs and SNNs with homeostasis produce a more wide variety of behaviors."},{"n":"15","id":"nadizar2023grammatical","title":"A Grammatical Evolution Approach to the Automatic Inference of P Systems","author":"G. Nadizar, G. Pietropolli","venue":"Journal of Membrane Computing (JMC)","year":"2023","type":"journal","doi":"10.1007/s41965-023-00125-w\n","full_text":"https://drive.google.com/file/d/1iWPEhVI8Zd3xWsOA98LBfqB_JXFlVAQb/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{nadizar2023grammatical,\n  title={{A grammatical evolution approach to the automatic inference of P systems}},\n  author={Nadizar, Giorgia and Pietropolli, Gloria},\n  journal={{Journal of Membrane Computing}},\n  volume={5},\n  number={3},\n  pages={129--143},\n  year={2023},\n  publisher={Springer},\n  doi={10.1007/s41965-023-00125-w}\n}","abstract":"P systems are a bio-inspired framework for defining parallel models of computation. Despite their relevance for both theoretical and application scenarios, the design and the identification of P systems remain tedious and demanding tasks, requiring considerable time and expertise. In this work, we try to address these problems by proposing an automated methodology based on Grammatical Evolution (GE)—an evolutionary computation technique—which does not require any domain knowledge. We consider a setting where observations of successive configurations of a P system are available, and we rely on GE for automatically inferring the P system, i.e., its ruleset. Such approach directly addresses the identification problem, but it can also be employed for automated design, requiring the designer to simply express the configurations of the P system rather than its full ruleset. We assess the practicability of the proposed method on six problems of various difficulties and evaluate its behavior in terms of inference capability and time consumption. Experimental results confirm our approach is a viable strategy for small problem sizes, where it achieves perfect inference in a few seconds without any human intervention. Moreover, we also obtain promising results for larger problem sizes in a human-aided context, paving the way for fully- or partially-automated design of P systems."},{"n":"16","id":"medvet2023evolutionary","title":"Evolutionary Machine Learning in Robotics\n","author":"E. Medvet, G. Nadizar, F. Pigozzi, E. Salvato","venue":"Chapter in Handbook of Evolutionary Machine Learning\n\n","year":"2023","type":"chapter","doi":"10.1007/978-981-99-3814-8_23","full_text":"https://drive.google.com/file/d/1ouB_cFLj1l6aGeltQGtKfIf25fFXFqjt/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@incollection{medvet2023evolutionary,\n  title={{Evolutionary Machine Learning in Robotics}},\n  author={Medvet, Eric and Nadizar, Giorgia and Pigozzi, Federico and Salvato, Erica},\n  booktitle={{Handbook of Evolutionary Machine Learning}},\n  pages={657--694},\n  year={2023},\n  publisher={Springer},\n  doi={10.1007/978-981-99-3814-8_23}\n}","abstract":"In this chapter, we survey the most significant applications of EML to robotics. We first highlight the salient characteristics of the field in terms of what can be optimized and with what aims and constraints. Then we survey the large literature concerning the optimization, by the means of evolutionary computation, of artificial neural networks, traditionally considered a form of machine learning, used for controlling the robots: for easing the comprehension, we categorize the various approaches along different axes, as, e.g., the robotic task, the representation of the solutions, the evolutionary algorithm being employed. We then survey the many usages of evolutionary computation for optimizing the morphology of the robots, including those that tackle the challenging task of optimizing the morphology and the controller at the same time. Finally, we discuss the reality gap problem, that consists in a potential mismatch between the quality of solutions found in simulations and their quality observed in reality."},{"n":"17","id":"pietrosanti2023human","title":"Human Control of Simulated Modular Soft Robots may Predict the Performance of Optimized AI-based Controllers","author":"G. Marchiori Pietrosanti, G. Nadizar, F. Pigozzi, E. Medvet","venue":"IEEE Access","year":"2023","type":"journal","doi":"10.1109/ACCESS.2023.3342912\n\n","full_text":"https://drive.google.com/file/d/1ggBxPeY9omZtkevHTJoa_t0wErF7LIU3/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{pietrosanti2023human,\n  title={{Human Control of Simulated Modular Soft Robots may Predict the Performance of Optimized AI-based Controllers}},\n  author={Pietrosanti, Giulia Marchiori and Nadizar, Giorgia and Pigozzi, Federico and Medvet, Eric},\n  journal={{IEEE Access}},\n  year={2023},\n  publisher={IEEE},\n  doi={10.1109/ACCESS.2023.3342912}\n}","abstract":"Robots with a modular body permit a wide range of physical configurations, which can be obtained by arranging the composing modules differently. While this freedom makes modular robots capable of performing different tasks, finding the optimal physical configuration for a given task is not trivial. In fact, practitioners attempt to jointly optimize the body and the controller of the robot for a given task, but the result is not always satisfactory. More broadly, it is not clear what factors make a physical configuration more or less successful. In this paper, we aim to fill this gap and verify if humans can be predictive with respect to the performance of an optimized controller for a given robot body. We consider the case of Voxel-based Soft Robots (VSRs), whose rich dynamic induced by the softness of the modules makes the body particularly relevant for the robot ability to perform a task. We instantiate a number of (simulated) VSR bodies, differing in shape and actuation mechanism, and let a panel of humans control them, by means of online interaction with the simulator, while performing the task of locomotion. We use the same bodies with controllers obtained with evolutionary optimization, for the same task. We compare the ranking of human- and optimized AI-based VSRs, finding them very similar. We believe that our results strengthen the hypothesis that intrinsic factors in the body of modular robots determine their success."},{"n":"18","id":"nadizar2024naturally","title":"Naturally Interpretable Control Policies via Graph-based Genetic Programming","author":"G. Nadizar, E. Medvet, D.G. Wilson","venue":"27th European Conference on Genetic Programming (EuroGP)","year":"2024","type":"conference","doi":"10.1007/978-3-031-56957-9_5","full_text":"https://drive.google.com/file/d/1zoS4Favc1pCWQPC9mw3s_oWUgOlFY-4m/view","slides":"https://drive.google.com/file/d/1fxnvpcBUDTwwxipRrPYUfXW8t61aFvJT/view","video":"https://giorgia-nadizar.github.io/cgpax/","notes":"Best paper award","code":"https://github.com/giorgia-nadizar/cgpax","poster":"https://drive.google.com/file/d/1GP62nZ2BQN6K8JhFh02FD5HtgCRrXlO-/view","cite":"@inproceedings{nadizar2024naturally,\n  title={{Naturally Interpretable Control Policies via Graph-Based Genetic Programming}},\n  author={Nadizar, Giorgia and Medvet, Eric and Wilson, Dennis G},\n  booktitle={{European Conference on Genetic Programming (Part of EvoStar)}},\n  pages={73--89},\n  year={2024},\n  organization={Springer},\n  doi={10.1145/3643688}\n}","abstract":"In most high-risk applications, interpretability is crucial for ensuring system safety and trust. However, existing research often relies on hard-to-understand, highly parameterized models, such as neural networks. In this paper, we focus on the problem of policy search in continuous observations and actions spaces. We leverage two graph-based Genetic Programming (GP) techniques—Cartesian Genetic Programming (CGP) and Linear Genetic Programming (LGP)—to develop effective yet interpretable control policies. Our experimental evaluation on eight continuous robotic control benchmarks shows competitive results compared to state-of-the-art Reinforcement Learning (RL) algorithms. Moreover, we find that graph-based GP tends towards small, interpretable graphs even when competitive with RL. By examining these graphs, we are able to explain the discovered policies, paving the way for trustworthy AI in the domain of continuous control."},{"n":"19","id":"nadizar2024analysis","title":"An Analysis of the Ingredients for Learning Interpretable Symbolic Regression Models with Human-in-the-Loop and Genetic Programming","author":"G. Nadizar, L. Rovito, A. De Lorenzo, E. Medvet, M. Virgolin","venue":"ACM Transactions on Evolutionary Learning and Optimization (TELO)","year":"2024","type":"journal","doi":"10.1145/3643688","full_text":"https://drive.google.com/file/d/1UFuq2k-xAHEllu81ROJp4t-IgMJUwafn/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{nadizar2024analysis,\n  title={{An analysis of the ingredients for learning interpretable symbolic regression models with human-in-the-loop and genetic programming}},\n  author={Nadizar, Giorgia and Rovito, Luigi and De Lorenzo, Andrea and Medvet, Eric and Virgolin, Marco},\n  journal={{ACM Transactions on Evolutionary Learning and Optimization}},\n  volume={4},\n  number={1},\n  pages={1--30},\n  year={2024},\n  publisher={ACM New York, NY},\n  doi={10.1145/3643688}\n}","abstract":"Interpretability is a critical aspect to ensure a fair and responsible use of machine learning (ML) in high-stakes applications. Genetic programming (GP) has been used to obtain interpretable ML models because it operates at the level of functional building blocks: if these building blocks are interpretable, there is a chance that their composition (i.e., the entire ML model) is also interpretable. However, the degree to which a model is interpretable depends on the observer. Motivated by this, we study a recently-introduced human-in-the-loop system that allows the user to steer GP’s generation process to their preferences, which shall be online-learned by an artificial neural network (ANN). We focus on the generation of ML models as analytical functions (i.e., symbolic regression) as this is a key problem in interpretable ML, and propose a two-fold contribution. First, we devise more general representations for the ML models for the ANN to learn upon, to enable the application of the system to a wider range of problems. Second, we delve into a deeper analysis of the system’s components. To this end, we propose an incremental experimental evaluation, aimed at studying the effectiveness by which an ANN can capture the perceived interpretability for simulated users,investigating how the GP’s outcome is affected across different simulated user feedback profiles, anddetermining whether humans participants would prefer models that were generated with or without their involvement.\nOur results pose clarity on pros and cons of using a human-in-the-loop approach to discover interpretable ML models with GP."},{"n":"20","id":"nadizar2024interpretable","title":"Interpretable Control of Modular Soft Robots","author":"G. Nadizar, E. Medvet","venue":"French Regional Conference on Complex Systems (FRCCS)","year":"2024","type":"conference","doi":"10.5281/zenodo.11267401","full_text":"https://drive.google.com/file/d/1g-8L6CnUrABrfhGY2hSkDYEpPTKFcjGL/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2024interpretable,\n  title={{Interpretable Control of Modular Soft Robots}},\n  author={Nadizar, Giorgia and Medvet, Eric},\n  year={2024},\n  booktitle={{French Regional Conference on Complex Systems (FRCCS)}},\n  keywords={local}\n}","abstract":"Modular Soft Robots (MSRs) are ensembles of elastic modules which achieve movement through their synergy of contractions and expansions. The inherent complexity of the dynamics of MSRs poses challenges in hand-crafting effective controllers for task execution. While Artificial Neural Networks (ANNs) have often been employed to this end, they lack transparency, preventing understanding the agent’s inner functionality and problem-solving strategy. To tackle this issue, we propose to adopt interpretable controllers, in the form of graphs, to be optimized with Graph-based Genetic Programming (GGP). This methodology enables the optimization of effective controllers, which can also facilitate gaining insights into information flow and decision-making processes within MSRs. From preliminary experiments, we find our approach feasible and promising."},{"n":"21","id":"nadizar2024searching","title":"Searching for a Diversity of Interpretable Graph Control Policies","author":"G. Nadizar, E. Medvet, D.G. Wilson","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2024","type":"conference","doi":"10.1145/3638529.3653987","full_text":"https://drive.google.com/file/d/1rXiOaZlAFRnwb4ZayXL2nkm4C4pTNHFd/view","slides":"https://drive.google.com/file/d/1YOvTFPQlOEIQaQ8eLjM8mNcgpWzVBg4D/view","video":"","notes":"","code":"https://github.com/giorgia-nadizar/QDax/tree/feat/cgp","poster":"","cite":"@inproceedings{nadizar2024searching,\n  title={{Searching for a Diversity of Interpretable Graph Control Policies}},\n  author={Nadizar, Giorgia and Medvet, Eric and Wilson, Dennis},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference}},\n  pages={933--941},\n  year={2024},\n  doi={10.1145/3638529.3653987}\n}","abstract":"Graph-based Genetic Programming (GGP) can create interpretable control policies in graph form, but faces challenges such as local optima and solution fragility, which undermine its efficacy. Quality-Diversity (QD) has been effective in addressing similar issues, traditionally in Artificial Neural Network (ANN) optimization. In this paper, we introduce a general Graph Quality-Diversity (G-QD) framework to enhance the performance of GGP with QD optimization, obtaining a variety of interpretable, effective, and resilient policies. Using Cartesian Genetic Programming (CGP) as the GGP technique and MAP-Elites (ME) as the QD algorithm, we leverage a combination of behavior and graph structural descriptors. Experimenting on two navigation and two locomotion continuous control tasks, our framework yields an array of effective yet behaviorally and structurally diverse policies, surpassing the performance of a standard Genetic Algorithm (GA). The resulting solution set also increases interpretability, allowing for insight into the control tasks. Additionally, our experiments demonstrate the robustness of the to faults such as sensor damage."},{"n":"22","id":"jorgensen2024large","title":"Large Language Model-based Test Case Generation for GP Agents","author":"S. Jorgensen, G. Nadizar, G. Pietropolli, L. Manzoni, E. Medvet, U. O'Reilly, E. Hemberg","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2024","type":"conference","doi":"10.1145/3638529.3654056","full_text":"https://drive.google.com/file/d/1VSj-3Sfdi-3oRT613AsX6ey1hSGrfdUv/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{jorgensen2024large,\n  title={{Large Language Model-based Test Case Generation for GP Agents}},\n  author={Jorgensen, Steven and Nadizar, Giorgia and Pietropolli, Gloria and Manzoni, Luca and Medvet, Eric and O'Reilly, Una-May and Hemberg, Erik},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference}},\n  pages={914--923},\n  year={2024},\n  doi={10.1145/3638529.3654056}\n}","abstract":"Genetic programming (GP) is a popular problem-solving and optimization technique. However, generating effective test cases for training and evaluating GP programs requires strong domain knowledge. Furthermore, GP programs often prematurely converge on local optima when given excessively difficult problems early in their training. Curriculum learning (CL) has been effective in addressing similar issues across different reinforcement learning (RL) domains, but it requires the manual generation of progressively difficult test cases as well as their careful scheduling. In this work, we leverage the domain knowledge and the strong generative abilities of large language models (LLMs) to generate effective test cases of increasing difficulties and schedule them according to various curricula. We show that by integrating a curriculum scheduler with LLM-generated test cases we can effectively train a GP agent player with environments-based curricula for a single-player game and opponent-based curricula for a multi-player game. Finally, we discuss the benefits and challenges of implementing this method for other problem domains."},{"n":"23","id":"elsaliby2024eventually","title":"Eventually, All You Need is a Simple Evolutionary Algorithm (for Neuroevolution of Continuous Control Policies)","author":"M. El Saliby, G. Nadizar, E. Salvato, E. Medvet","venue":"Workshop on Neuroevolution at Work (NEWK@GECCO)","year":"2024","type":"conference","doi":"10.1145/3638530.3664112","full_text":"https://drive.google.com/file/d/1km1JJnbf9IT84B-YiHPI8w_ATAf02siD/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{el2024eventually,\n  title={{Eventually, all you need is a simple evolutionary algorithm (for neuroevolution of continuous control policies)}},\n  author={El Saliby, Michel and Nadizar, Giorgia and Salvato, Erica and Medvet, Eric},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference Companion}},\n  pages={1904--1913},\n  year={2024},\n  keywords={workshop},\n  doi={10.1145/3638530.3664112}\n}","abstract":"Artificial neural networks (ANNs) are a popular choice for tackling continuous control tasks due to their approximation abilities. When the ANN architecture is fixed, finding optimal weights becomes a numerical optimization problem, suitable for evolutionary algorithms (EAs), i.e., a form of neuroevolution. Here, we compare the performance of well-established EAs in solving neuroevolution problems, focusing on continuous control. We evaluate them on a set of navigation problems and a set of control problems based on modular soft robots. As a reference, we compare the same EAs on regression problems and classic numerical optimization benchmarks. Our findings suggest that simple EAs like genetic algorithm (GA) and differential evolution (DE) achieve good performance on control problems, even if they are surpassed by more sophisticated algorithms on benchmark problems. We hypothesize that the effectiveness of these simpler EAs stems from their use of crossover, which can be advantageous in the rugged fitness landscapes encountered in complex control tasks."},{"n":"24","id":"nadizar2024competition","title":"Interpretable Control Competition","author":"G. Nadizar, L. Rovito, D.G. Wilson, E. Medvet","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2024","type":"competition","doi":"10.1145/3638530.3664051","full_text":"https://drive.google.com/file/d/1jnDHUZwa69jvVhqAIdNsN2W-9BcSuc4O/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2024competition,\n  title={{Interpretable Control Competition}},\n  author={Nadizar, Giorgia and Rovito, Luigi and Wilson, Dennis G. and Medvet, Eric},\n  booktitle={{Proceedings of the Genetic and Evolutionary Computation Conference Companion}},\n  pages={11--12},\n  year={2024},\n  keywords={workshop},\n  doi={10.1145/3638530.3664051}\n}","abstract":"Safety-critical applications rely on control systems-managed components, which not only have demanding requirements in terms of accuracy, but also require transparency and interpretability, to ensure trustworthiness. However, interpretability is often overlooked in favor of performance as (i) people perceive it as secondary, and (ii) there are no objective methods for measuring it. To address these shortcomings and raise awareness about the importance of interpretability in control systems, we propose the Interpretable Control Competition at GECCO 2024. We invite participants to solve two control problems, a discrete and a continuous one, with interpretable policies. We assess the policies in terms of both performance and interpretability, where the latter is evaluated by a pool of domain experts. Our overarching goal is to collect the contributions in a report, which should provide a guideline for practitioners in the field, gathering an array of state-of-the-art methods for interpretable control, together with suitable metrics for assessing the interpretability of a policy."},{"n":"25","id":"nadizar2024geometric","title":"Geometric Semantic GP with Linear Scaling: Darwinian versus Lamarckian Evolution","author":"G. Nadizar, B. Sakallioglu, F. Garrow, S. Silva, L. Vanneschi","venue":"Genetic Programming and Evolvable Machines (GPEM)","year":"2024","type":"journal","doi":"10.1007/s10710-024-09488-0","full_text":"https://drive.google.com/file/d/1V0J_aMcNWy1MgVSznnaGpFo0DmdyOvLg/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{nadizar2024geometric,\n  title={{Geometric semantic GP with linear scaling: Darwinian versus Lamarckian evolution}},\n  author={Nadizar, Giorgia and Sakallioglu, Berfin and Garrow, Fraser and Silva, Sara and Vanneschi, Leonardo},\n  journal={{Genetic Programming and Evolvable Machines}},\n  volume={25},\n  number={2},\n  pages={1--24},\n  year={2024},\n  publisher={Springer},\n  doi={10.1007/s10710-024-09488-0}\n}","abstract":"Geometric Semantic Genetic Programming (GSGP) has shown notable success in symbolic regression with the introduction of Linear Scaling (LS). This achievement stems from the synergy of the geometric semantic genetic operators of GSGP with the scaling of the individuals for computing their fitness, which favours programs with a promising behaviour. However, the initial combination of GSGP and LS (GSGP-LS) underutilised the potential of LS, scaling individuals only for fitness evaluation, neglecting to incorporate improvements into their genetic material. In this paper we propose an advancement, GSGP with Lamarckian LS (GSGP-LLS), wherein we update the individuals in the population with their scaling coefficients in a Lamarckian fashion, i.e., by inheritance of acquired traits.    We assess GSGP-LS and GSGP-LLS against standard GSGP for the task of symbolic regression on five hand-tailored benchmarks and six real-life problems. On the former ones, GSGP-LS and GSGP-LLS both consistently improve GSGP, though with no clear global superiority between them. On the real-world problems, instead, GSGP-LLS steadily outperforms GSGP-LS, achieving faster convergence and superior final performance. Notably, even in cases where LS induces overfitting on challenging problems, GSGP-LLS surpasses GSGP-LS, due to its slower and more localised optimisation steps."},{"n":"26","id":"elsaliby2024factors","title":"Factors Impacting Landscape Ruggedness in Control Problems: a Case Study","author":"M. El Saliby, E. Medvet, G. Nadizar, E. Salvato, S.L. Thomson","venue":"XVIII International Workshop on Artificial Life and Evolutionary Computation (WIVACE)","year":"2024","type":"conference","doi":"10.1007/978-3-031-93631-9_6","full_text":"https://drive.google.com/file/d/1Un_e3XfBN_JebQMpxdrgNMel6M27anvH/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{el2024factors,\n  title={Factors Impacting Landscape Ruggedness in Control Problems: A Case Study},\n  author={El Saliby, Michel and Medvet, Eric and Nadizar, Giorgia and Salvato, Erica and Thomson, Sarah L},\n  booktitle={Italian Workshop on Artificial Life and Evolutionary Computation},\n  pages={70--83},\n  year={2024},\n  organization={Springer},\n  keywords={workshop},\n  doi={10.1007/978-3-031-93631-9_6}\n}","abstract":"Understanding fitness landscapes in evolutionary robotics (ER) can provide valuable insights into the considered robotic problems as well as into the strategies found by evolutionary algorithms (EAs) to address them, ultimately guiding practitioners toward better design choices. However, most studies on fitness landscape analysis have been conducted on theoretical benchmarks, lacking direct relevance to practical robotics applications. This work aims to bridge this gap by (1) gathering a variety of measures to assess the ruggedness of a fitness landscape, (2) validating them on a simple benchmark problem with a known and tunable fitness landscape, and (3) applying these measures to a continuous control problem—a robotic navigation task. Using a highly customisable task, we investigate how various factors, including environmental conditions (i.e., the arena configuration), agent perception (i.e., the robot sensors), controller design (i.e., the structure of the artificial neural network controlling the robot), and fitness shaping (i.e., how the robot is rewarded for its behaviour) influence the ruggedness of the fitness landscape. Our findings suggest that simple measures can be sufficiently informative of the ruggedness of a given fitness landscape. Regarding the considered factors, we find that the ruggedness is primarily affected by the fitness shaping, followed by the controller features, while other factors tend to have a minor impact."},{"n":"27","id":"ferigo2024totipotent","title":"Totipotent Neural Controllers for Modular Soft Robots: Achieving Specialization in Body-Brain Co-Evolution through Hebbian Learning","author":"A. Ferigo, G. Iacca, E. Medvet, G. Nadizar","venue":"Neurocomputing","year":"2024","type":"journal","doi":"10.1016/j.neucom.2024.128811","full_text":"https://drive.google.com/file/d/1qP4p5eVDXPcD-DU1p0gp0JQBLaGUkjEb/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{ferigo2024totipotent,\n  title={{Totipotent neural controllers for modular soft robots: Achieving specialization in body-brain co-evolution through Hebbian learning}},\n  author={Ferigo, Andrea and Iacca, Giovanni and Medvet, Eric and Nadizar, Giorgia},\n  journal={{Neurocomputing}},\n  pages={128811},\n  year={2024},\n  publisher={Elsevier},\n  doi={10.1016/j.neucom.2024.128811}\n}","abstract":"Multi-cellular organisms typically originate from a single cell, the zygote, that then develops into a multitude of structurally and functionally specialized cells. The potential of generating all the specialized cells that make up an organism is referred to as cellular “totipotency”, a concept introduced by the German plant physiologist Haberlandt in the early 1900s. In an attempt to reproduce this mechanism in synthetic organisms, we present a model based on a kind of modular robot called Voxel-based Soft Robot (VSR), where both the body, i.e., the arrangement of voxels, and the brain, i.e., the Artificial Neural Network (ANN) controlling each module, are subject to an evolutionary process aimed at optimizing the locomotion capabilities of the robot. In an analogy between totipotent cells and totipotent ANN-controlled modules, we then include in our model an additional level of adaptation provided by Hebbian learning, which allows the ANNs to adapt their weights during the execution of the locomotion task. Our in silico experiments reveal two main findings. Firstly, we confirm the common intuition that Hebbian plasticity effectively allows better performance and adaptation. Secondly and more importantly, we verify for the first time that the performance improvements yielded by plasticity are in essence due to a form of specialization at the level of single modules (and their associated ANN): thanks to plasticity, modules specialize to react in different ways to the same set of stimuli, i.e., they become functionally and behaviorally different even though their ANN are initialized in the same way. This mechanism, which can be seen as a form of totipotency at the level of ANN, can have, in our view, profound implications in various areas of Artificial Intelligence (AI) and applications thereof, such as modular robotics and multi-agent systems."},{"n":"28","id":"nadizar2025role","title":"The Role of Stepping Stones in MAP-Elites: Insights from Search Trajectory Networks","author":"G. Nadizar, F. Rusin, E. Medvet, G. Ochoa","venue":"28th European Conference on Genetic Programming (EuroGP)","year":"2025","type":"conference","doi":"10.1007/978-3-031-89991-1_14","full_text":"https://drive.google.com/file/d/12dWa_x4FYQt13-h5R68YieZYUmj8lmnq/view","slides":"https://drive.google.com/file/d/1NNvTVxND8t5Pd2zslhx3TaHwn70TmPtH/view","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2025role,\n  title={{The Role of Stepping Stones in MAP-Elites: Insights from Search Trajectory Networks}},\n  author={Nadizar, Giorgia and Rusin, Francesco and Medvet, Eric and Ochoa, Gabriela},\n  booktitle={{European Conference on Genetic Programming (Part of EvoStar)}},\n  year={2025},\n  organization={Springer},\n  doi={10.1007/978-3-031-89991-1_14}\n}","abstract":"MAP-Elites (ME) is a quality-diversity optimization algorithm designed to generate a diverse collection of high-performing solutions to complex problems by leveraging “stepping stones”. Stepping stones have been defined as intermediate solutions that, while not necessarily optimal themselves, contribute to the development of more effective final outcomes. A deeper understanding of the role of stepping stones in evolutionary optimization would be beneficial. To address this gap, we employ search trajectory networks (STNs), an analytical and visualization tool for studying the behavior of optimization algorithms. We refine the notion of stepping stones by incorporating the idea of betweenness centrality in networks. We consider a robotic navigation task with various controller representations (polynomials, artificial neural networks, and symbolic formulae encoded as trees), comparing the ME search process with that of a genetic algorithm, while also evaluating the differences across representations. Our findings show clearer evidence of stepping stones in ME, particularly when using more “direct” and “local” representations."},{"n":"29","id":"de2025evolved","title":"Evolved and Transparent Pipelines for Biomedical Image Classification ","author":"C. De La Torre, G. Nadizar, Y. Lavinas, R. Schwob, C. Franchet, H. Luga, D. Wilson, S. Cussat-Blanc","venue":"28th European Conference on Genetic Programming (EuroGP)","year":"2025","type":"conference","doi":"10.1007/978-3-031-89991-1_11","full_text":"https://hal.science/hal-05039992v1/file/paper_Arxiv.pdf","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{de2025evolved,\n  title={{Evolved and Transparent Pipelines for Biomedical Image Classification }},\n  author={De La Torre, Camilo and Nadizar, Giorgia and Lavinas, Yuri and Schwob, Robin and Franchet, Camille and Luga, Hervé and Wilson, Dennis and Cussat-Blanc, Sylvain},\n  booktitle={{European Conference on Genetic Programming (Part of EvoStar)}},\n  year={2025},\n  organization={Springer},\n  doi={10.1007/978-3-031-89991-1_11}\n}","abstract":"This article presents an interpretable approach to binary image classification using Genetic Programming (GP), applied to the Patch-Camelyon (PCAM) dataset, which contains small tissue biopsy patches labeled as malignant or benign. While Deep Neural Networks (DNNs) achieve high performance in image classification, their opaque decision-making processes, prone to overfitting behavior and dependency on large amounts of annotated data limit their utility in critical fields like digital pathology, where interpretability is essential. To address this, we employ GP, specifically using the Multi-Modal Adaptive Graph Evolution (MAGE) framework, to evolve end-to-end image classification pipelines. We trained MAGE a hundred times with the best optimized key hyperparameters for this task. Among all MAGE models trained, the best one achieved 78% accuracy on the validation set and 76% accuracy on the test set. Among Convolutional Neural Networks (CNNs), our baseline, the best model obtained 84.5% accuracy on the validation set and 77.1% accuracy on the test set. Unlike CNNs, our GP approach enables program-level transparency, facilitating interpretability through example-based reasoning. By analyzing evolved programs with medical experts, we highlight the transparency of decision-making in MAGE pipelines, offering an interpretable alternative for medical image classification tasks where model interpretability is paramount."},{"n":"30","id":"de2025evolution","title":"Evolution of Inherently Interpretable Visual Control Policies","author":"C. De La Torre, G. Nadizar, Y. Lavinas, H. Luga, D. Wilson, S. Cussat-Blanc","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2025","type":"conference","doi":"10.1145/3712256.3726332","full_text":"https://hal.science/hal-05178539v1/file/2025_GECCO_AtariMAGE_ARXIV_APPENDIX.pdf","slides":"","video":"","notes":"Best paper award","code":"","poster":"","cite":"@inproceedings{de2025evolution,\n  title={Evolution of Inherently Interpretable Visual Control Policies},\n  author={De La Torre, Camilo and Nadizar, Giorgia and Lavinas, Yuri and Luga, Herv{\\'e} and Wilson, Dennis G and Cussat-Blanc, Sylvain},\n  booktitle={GECCO'25: Genetic and Evolutionary Computation Conference},\n  pages={358--367},\n  year={2025},\n  organization={ACM},\n  doi={10.1145/3712256.3726332}\n}","abstract":"Vision-based decision-making tasks encompass a wide range of applications, including safety-critical domains where trustworthiness is as key as performance. These tasks are often addressed using Deep Reinforcement Learning (DRL) techniques, based on Artificial Neural Networks (ANNs), to automate sequential decision making. However, the “black-box” nature of ANNs limits their applicability in these settings, where transparency and accountability are essential. To address this, various explanation methods have been proposed; however, they often fall short in fully elucidating the decision-making pipeline of ANNs, a critical aspect for ensuring reliability in safety-critical applications. To bridge this gap, we propose an approach based on Graph-based Genetic Programming (GGP) to generate transparent policies for vision-based control tasks. Our evolved policies are constrained in size and composed of simple and well-understood operational modules, enabling inherent interpretability. We evaluate our method on three Atari games, comparing explanations derived from common explainability techniques to those derived from interpreting the agent’s true computational graph. We demonstrate that interpretable policies offer a more complete view of the decision process than explainability methods, enabling a full comprehension of competitive game-playing policies."},{"n":"31","id":"sakallioglu2025evolving","title":"Evolving Typed Token Processing Networks","author":"B. Sakallioglu, G. Nadizar, L. Manzoni, E. Medvet","venue":"Workshop on Graph-based Genetic Programming (GGP@GECCO)","year":"2025","type":"conference","doi":"10.1145/3712255.3734315","full_text":"https://drive.google.com/file/d/1vyMUjPUmIq6ThXN7v3BYCRsf2S8Q7CAs/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{sakallioglu2025evolving,\n  title={Evolving Typed Token Processing Networks},\n  author={Sakallioglu, Berfin and Nadizar, Giorgia and Manzoni, Luca and Medvet, Eric},\n  booktitle={Proceedings of the Genetic and Evolutionary Computation Conference Companion},\n  year={2025},\n  keywords={workshop},\n  doi={10.1145/3712255.3734315}\n}","abstract":"We propose a novel, type-consistent representation for programs manipulating arbitrary data types, that we call typed token processing networks (TTPNs). A TTPN is a network of interconnected stateless gates defining typed ports and processing functions: during the execution, data flows through the network as typed tokens carrying values. TTPNs favor interpretability as they can visually reveal the overall structure of a program and also highlight the way data is processed at runtime—enabling decomposability and simulatability, respectively. Moreover, like other graph representations, TTPNs enable component reuse. We evolve programs in the form of TTPNs from examples, i.e., we do program synthesis, with a simple genetic algorithm and ad hoc genetic operators. Our preliminary results show successful evolution of simple programs from small example sets involving diverse types, though some instances fail. We hypothesize that the particularly rugged fitness landscape imposed by our representation and, more in general, by the program synthesis scenario, may hinder convergence. We propose some directions for tackling these issues."},{"n":"32","id":"medvet2025quality","title":"Quality-Diversity in Problems with Composite Solutions: a Case Study on Body-Brain Robot Optimization","author":"E. Medvet, S. Lippolis, G. Nadizar","venue":"Genetic Programming and Evolvable Machines (GPEM)","year":"2025","type":"journal","doi":"10.1007/s10710-025-09520-x","full_text":"https://drive.google.com/file/d/16kEdOw7P62coMxj6gZgMGbuUbrfsTQ14/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{medvet2025quality,\n  title={Quality-diversity in problems with composite solutions: a case study on body--brain robot optimization},\n  author={Medvet, Eric and Lippolis, Samuele and Nadizar, Giorgia},\n  journal={Genetic Programming and Evolvable Machines},\n  volume={26},\n  number={2},\n  pages={1--36},\n  year={2025},\n  publisher={Springer},\n  doi={10.1007/s10710-025-09520-x}\n}","abstract":"When considering those optimization problems where the solution is a combination of two parts, as, e.g., the concurrent optimization of the body and the brain of a robotic agent, one might want to solve them “in a quality-diversity (QD) way”, i.e., obtaining not just one very good solution, but a set of good and diverse solutions. We call them QD composite problems, and we propose a general formulation for them, as well as a set of indexes useful for comprehensively assessing solutions by measuring both quality and diversity. We experimentally compare a few QD evolutionary algorithms (EAs) on a case study of body-brain optimization of simulated robots, including several variants of MAP-elites (ME), a popular and effective EA for QD. We also propose a novel ME variant, called coevolutionary MAP-elites (CoME), that internally employs two populations, one for each part of the solution, and enforces diversity on them through user-provided descriptors, as the underlying ME does. CoME, instead of blindly combining all the respective parts to obtain full solutions, adopts a specific mapping strategy that is based on the location of each solution part in the respective descriptors space. The results of our comparative analysis show that ME works well in QD composite problems, but only if two archives, instead of just one, are employed, one for each part of the solution. Moreover, we show that the use of multi-archive variants of ME, e.g., CoME, can provide insights on the interplay between the two parts of the solution for the problem at hand, shedding light on key dynamics in co-evolution."},{"n":"33","id":"nadizar2025enhancing","title":"Enhancing Adaptability in Embodied Agents: a Multi-Quality-Diversity Approach","author":"G. Nadizar, E. Medvet, D.G. Wilson","venue":"IEEE Transactions on Evolutionary Computation (TEVC)","year":"2025","type":"journal","doi":"10.1109/TEVC.2025.3596746","full_text":"https://drive.google.com/file/d/1C4Eo3moLbOA3F5bfKGmwrfcdjEY7lKK3/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{nadizar2025enhancing,\n  title={Enhancing Adaptability in Embodied Agents: A Multi-Quality-Diversity Approach},\n  author={Nadizar, Giorgia and Medvet, Eric and Wilson, Dennis G},\n  journal={IEEE Transactions on Evolutionary Computation},\n  year={2025},\n  publisher={IEEE},\n  doi={10.1109/TEVC.2025.3596746}\n}","abstract":"On the path towards truly autonomous robots, embodied agents will require to be adaptable to unforeseen circumstances. Yet, most robotic agents still suffer from significant performance degradation when scenarios change slightly, with many even failing their tasks entirely. In contrast, organisms in nature exhibit strong adaptability, largely due to bio-diversity, which has prevented the extinction of life throughout severe environmental changes. The concept of quality-diversity aims to emulate this natural resilience, yielding robust results through diversification of embodied agents in the behavior space. However, in nature, diversity occurs simultaneously at multiple levels: body, brain, and behavior. This study on the body-brain optimization of virtual embodied agents spans two brain representations—an artificial neural network (ANN) and a graph—and investigates these levels to determine the most critical scope for diversity in fostering performance, generality, and robustness. We start by optimizing for a simple locomotion task, and then evaluate generality through transfer to a diverse set of tasks, including locomotion in new environments and interaction with objects. Our findings confirm the importance of simultaneously considering multiple axes of diversity for achieving good performance and adaptability—demonstrating zero-shot transfer on 18 new tasks. Moreover, we observe that the graph controller performs on par with the ANN, offering greater interpretability."},{"n":"34","id":"jorgensen2025policy","title":"Policy Search through Genetic Programming and LLM-assisted Curriculum Learning","author":"S. Jorgensen, G. Nadizar, G. Pietropolli, L. Manzoni, E. Medvet, U. O'Reilly, E. Hemberg","venue":"ACM Transactions on Evolutionary Learning and Optimization (TELO)","year":"2025","type":"journal","doi":"10.1145/3772718","full_text":"https://drive.google.com/file/d/14OvV2vrOwAEWRatuwSi1DwGeRj2Nkrce/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{jorgensen2025policy,\n  title={Policy Search through Genetic Programming and LLM-assisted Curriculum Learning},\n  author={Jorgensen, Steven and Nadizar, Giorgia and Pietropolli, Gloria and Manzoni, Luca and Medvet, Eric and O'Reilly, Una-May and Hemberg, Erik},\n  journal={ACM Transactions on Evolutionary Learning},\n  year={2025},\n  publisher={ACM New York, NY}\n}","abstract":"Curriculum learning (CL) consists in using a diverse set of user-provided test cases, with varying levels of difficulty and organized in a suitable progression, for learning a policy. The quality of test cases is important to allow optimization techniques as genetic programming (GP) to solve policy search problems. In this work, we evaluate large language models (LLMs) as providers of test cases for GP-based policy search. We consider two policy search tasks, a single-player and a multi-player game, and four LLMs differing in complexity and specialization, which we prompt in order to generate suitable test cases for the two games. We experimentally assess the intrinsic quality of LLM-generated test cases and their utility when inserted in a curriculum consumed by a GP optimization. We evaluate the robustness of the approach with respect to the way cases are scheduled in curricula and with respect to the policy representation, for which we use both graphs and linear programs evolved by GP. We observe that the effectiveness of LLM-assisted CL depends on both the choice of LLM and the design of the prompting and scheduling strategies. These findings highlight important considerations for leveraging LLMs in automated curriculum design for GP-based optimization."}]