[{"id":"nadizar2021effects","title":"On the Effects of Pruning on Evolved Neural Controllers for Soft Robots","author":"G. Nadizar, E. Medvet, F.A. Pellegrino, M. Zullich, S. Nichele","venue":"Workshop on Neuroevolution at Work (NEWK@GECCO)","year":"2021","type":"conference","publisher_link":"https://dl.acm.org/doi/abs/10.1145/3449726.3463161","full_text":"https://drive.google.com/file/d/1icWdoHdqNieFerpcTlQooeMb0t_KDW8n/view","slides":"https://drive.google.com/file/d/1_O4JkHlWHfXFkOw5c1jkVg5050Un43CU/view","doi":"10.1145/3449726.3463161","notes":"","abstract":"Artificial neural networks (ANNs) are commonly used for controlling robotic agents. For robots with many sensors and actuators, ANNs can be very complex, with many neurons and connections. Removal of neurons or connections, i.e., pruning, may be desirable because (i) it reduces the complexity of the ANN, making its operation more energy efficient, and (ii) it might improve the generalization ability of the ANN. Whether these goals can actually be achieved in practice is however still not well known. On the other hand, it is widely recognized that pruning in biological neural networks plays a fundamental role in the development of brains and their ability to learn. In this work, we consider the case of Voxel-based Soft Robots, a kind of robots where sensors and actuators are distributed over the body and that can be controlled with ANNs optimized by means of neuroevolution. We experimentally characterize the effect of different forms of pruning on the effectiveness of neuroevolution, also in terms of generalization ability of the evolved ANNs. We find that, with some forms of pruning, a large portion of the connections can be pruned without strongly affecting robot capabilities. We also observe sporadic improvements in generalization ability."},{"id":"nadizar2022merging","title":"Merging Pruning and Neuroevolution: towards Robust and Efficient Controllers for Modular Soft Robots","author":"G. Nadizar, E. Medvet, S. Nichele, O. Huse Ramstad, F.A. Pellegrino, M. Zullich","venue":"Knowledge Engineering Review (KER)","year":"2022","type":"journal","publisher_link":"","full_text":"","slides":"","doi":"","notes":"","abstract":"Artificial neural networks (ANNs) can be employed as controllers for robotic agents. Their structure is often complex, with many neurons and connections, especially when the robots have many sensors and actuators distributed across their bodies and/or when high expressive power is desirable. Pruning (removing neurons or connections) reduces the complexity of the ANN, thus increasing its energy efficiency, and has been reported to improve the generalization capability, in some cases. In addition, it is well-known that pruning in biological neural networks plays a fundamental role in the development of brains and their ability to learn. In this work, we consider the evolutionary optimization of neural controllers for the case study of Voxel-based Soft Robots, a kind of modular, bio-inspired soft robots, applying pruning during fitness evaluation. For a locomotion task, and for centralized as well as distributed controllers, we experimentally characterize the effect of different forms of pruning on after-pruning effectiveness, life-long effectiveness, adaptability to new terrains, and behavior. We find that incorporating some forms of pruning in neuroevolution leads to almost equally effective controllers as those evolved without pruning, with the benefit of higher robustness to pruning. We also observe occasional improvements in generalization ability."},{"id":"nadizar2022schedule","title":"On the Schedule for Morphological Development of Evolved Modular Soft Robots","author":"G. Nadizar, E. Medvet, K. Miras","venue":"25th European Conference on Genetic Programming (EuroGP)","year":"2022","type":"conference","publisher_link":"","full_text":"","slides":"","doi":"","notes":"","abstract":"Development is fundamental for living beings. As robots are often designed to mimic biological organisms, development is believed to be crucial for achieving successful results in robotic agents, as well. What is not clear, though, is the most appropriate scheduling for development. While in real life systems development happens mostly during the initial growth phase of organisms, it has not yet been investigated whether such assumption holds also for artificial creatures. In this paper, we employ a evolutionary approach to optimize the development—according to different representations—of Voxel-based Soft Robots (VSRs), a kind of modular robots. In our study, development consists in the addition of new voxels to the VSR, at fixed time instants, depending on the development schedule. We experiment with different schedules and show that, similarly to living organisms, artificial agents benefit from development occurring at early stages of life more than from development lasting for their entire life."}]