[{"n":"01","id":"nadizar2021effects","title":"On the Effects of Pruning on Evolved Neural Controllers for Soft Robots","author":"G. Nadizar, E. Medvet, F.A. Pellegrino, M. Zullich, S. Nichele","venue":"Workshop on Neuroevolution at Work (NEWK@GECCO)","year":"2021","type":"conference","doi":"10.1145/3449726.3463161","full_text":"https://drive.google.com/file/d/1icWdoHdqNieFerpcTlQooeMb0t_KDW8n/view","slides":"https://drive.google.com/file/d/1_O4JkHlWHfXFkOw5c1jkVg5050Un43CU/view","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2021effects,\n  title={On the effects of pruning on evolved neural controllers for soft robots},\n  author={Nadizar, Giorgia and Medvet, Eric and Pellegrino, Felice Andrea and Zullich, Marco and Nichele, Stefano},\n  booktitle={Proceedings of the Genetic and Evolutionary Computation Conference Companion},\n  pages={1744--1752},\n  year={2021}\n}","abstract":"Artificial neural networks (ANNs) are commonly used for controlling robotic agents. For robots with many sensors and actuators, ANNs can be very complex, with many neurons and connections. Removal of neurons or connections, i.e., pruning, may be desirable because (i) it reduces the complexity of the ANN, making its operation more energy efficient, and (ii) it might improve the generalization ability of the ANN. Whether these goals can actually be achieved in practice is however still not well known. On the other hand, it is widely recognized that pruning in biological neural networks plays a fundamental role in the development of brains and their ability to learn. In this work, we consider the case of Voxel-based Soft Robots, a kind of robots where sensors and actuators are distributed over the body and that can be controlled with ANNs optimized by means of neuroevolution. We experimentally characterize the effect of different forms of pruning on the effectiveness of neuroevolution, also in terms of generalization ability of the evolved ANNs. We find that, with some forms of pruning, a large portion of the connections can be pruned without strongly affecting robot capabilities. We also observe sporadic improvements in generalization ability."},{"n":"02","id":"nadizar2022merging","title":"Merging Pruning and Neuroevolution: towards Robust and Efficient Controllers for Modular Soft Robots","author":"G. Nadizar, E. Medvet, S. Nichele, O. Huse Ramstad, F.A. Pellegrino, M. Zullich","venue":"Knowledge Engineering Review (KER)","year":"2022","type":"journal","doi":"10.1017/S0269888921000151","full_text":"https://drive.google.com/file/d/1vDBESobcKRld9-RJ103IFY86aQTzR6az/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@article{nadizar2022merging,\n  title={Merging pruning and neuroevolution: towards robust and efficient controllers for modular soft robots},\n  author={Nadizar, Giorgia and Medvet, Eric and Ramstad, Hola Huse and Nichele, Stefano and Pellegrino, Felice Andrea and Zullich, Marco},\n  journal={The Knowledge Engineering Review},\n  volume={37},\n  year={2022},\n  publisher={Cambridge University Press}\n}","abstract":"Artificial neural networks (ANNs) can be employed as controllers for robotic agents. Their structure is often complex, with many neurons and connections, especially when the robots have many sensors and actuators distributed across their bodies and/or when high expressive power is desirable. Pruning (removing neurons or connections) reduces the complexity of the ANN, thus increasing its energy efficiency, and has been reported to improve the generalization capability, in some cases. In addition, it is well-known that pruning in biological neural networks plays a fundamental role in the development of brains and their ability to learn. In this work, we consider the evolutionary optimization of neural controllers for the case study of Voxel-based Soft Robots, a kind of modular, bio-inspired soft robots, applying pruning during fitness evaluation. For a locomotion task, and for centralized as well as distributed controllers, we experimentally characterize the effect of different forms of pruning on after-pruning effectiveness, life-long effectiveness, adaptability to new terrains, and behavior. We find that incorporating some forms of pruning in neuroevolution leads to almost equally effective controllers as those evolved without pruning, with the benefit of higher robustness to pruning. We also observe occasional improvements in generalization ability."},{"n":"03","id":"nadizar2022schedule","title":"On the Schedule for Morphological Development of Evolved Modular Soft Robots","author":"G. Nadizar, E. Medvet, K. Miras","venue":"25th European Conference on Genetic Programming (EuroGP)","year":"2022","type":"conference","doi":"10.1007/978-3-031-02056-8_10","full_text":"https://drive.google.com/file/d/194p4oxXWCE4J2xPrqhQTdmr0PSUx8q17/view","slides":"https://drive.google.com/file/d/1q0s9kFoHl_TqrMP_aNOuGCoyqz7Skwm0/view","video":"https://www.youtube.com/watch?v=DD4D20EH1sA&ab_channel=EricMedvet","notes":"Best student poster award","code":"https://github.com/giorgia-nadizar/VSREvoDevo","poster":"https://drive.google.com/file/d/1u53reNhuMiIyDYJLCl4d6VIwm86xDxHT/view","cite":"@inproceedings{nadizar2022schedule,\n  title={On the Schedule for Morphological Development of Evolved Modular Soft Robots},\n  author={Nadizar, Giorgia and Medvet, Eric and Miras, Karine},\n  booktitle={European Conference on Genetic Programming (Part of EvoStar)},\n  pages={146--161},\n  year={2022},\n  organization={Springer}\n}","abstract":"Development is fundamental for living beings. As robots are often designed to mimic biological organisms, development is believed to be crucial for achieving successful results in robotic agents, as well. What is not clear, though, is the most appropriate scheduling for development. While in real life systems development happens mostly during the initial growth phase of organisms, it has not yet been investigated whether such assumption holds also for artificial creatures. In this paper, we employ a evolutionary approach to optimize the development—according to different representations—of Voxel-based Soft Robots (VSRs), a kind of modular robots. In our study, development consists in the addition of new voxels to the VSR, at fixed time instants, depending on the development schedule. We experiment with different schedules and show that, similarly to living organisms, artificial agents benefit from development occurring at early stages of life more than from development lasting for their entire life."},{"n":"04","id":"nadizar2022collective","title":"Collective control of modular soft robots via embodied Spiking Neural Cellular Automata","author":"G. Nadizar, E. Medvet, S. Nichele, S. Pontes-Filho","venue":"Workshop on From Cells to Societies: Collective Learning across Scales (Cells2Societies@ICLR)","year":"2022","type":"conference","doi":"10.48550/arXiv.2204.02099","full_text":"https://drive.google.com/file/d/1wpkgmOICi0DFoIxf30HoBU17ILP_DQ_b/view","slides":"https://drive.google.com/file/d/12cW5C4j68NP_0NfOqLXaUjlDrjZHf-mK/view","video":"https://giorgia-nadizar.github.io/VSRCollectiveControlViaSNCA/","notes":"Best poster award","code":"https://github.com/giorgia-nadizar/VSRCollectiveControlViaSNCA","poster":"https://drive.google.com/file/d/1VRjFTHKsaqGpg05WCluQTfLlcPsAXPlz/view","cite":"@article{nadizar2022collective,\n  title={Collective control of modular soft robots via embodied Spiking Neural Cellular Automata},\n  author={Nadizar, Giorgia and Medvet, Eric and Nichele, Stefano and Pontes-Filho, Sidney},\n  journal={arXiv preprint arXiv:2204.02099},\n  year={2022}\n}","abstract":"Voxel-based Soft Robots (VSRs) are a form of modular soft robots, composed of several deformable cubes, i.e., voxels. Each VSR is thus an ensemble of simple agents, namely the voxels, which must cooperate to give rise to the overall VSR behavior. Within this paradigm, collective intelligence plays a key role in enabling the emerge of coordination, as each voxel is independently controlled, exploiting only the local sensory information together with some knowledge passed from its direct neighbors (distributed or collective control). In this work, we propose a novel form of collective control, influenced by Neural Cellular Automata (NCA) and based on the bio-inspired Spiking Neural Networks: the embodied Spiking NCA (SNCA). We experiment with different variants of SNCA, and find them to be competitive with the state-of-the-art distributed controllers for the task of locomotion. In addition, our findings show significant improvement with respect to the baseline in terms of adaptability to unforeseen environmental changes, which could be a determining factor for physical practicability of VSRs."},{"n":"05","id":"medvet2022jgea","title":"JGEA: a Modular Java Framework for Experimenting with Evolutionary Computation","author":"E. Medvet, G. Nadizar, L. Manzoni","venue":"Workshop Evolutionary Computation Software Systems (EvoSoft@GECCO)","year":"2022","type":"conference","doi":"10.1145/3520304.3533960","full_text":"https://drive.google.com/file/d/1wZ-B5lh2U4BWqmJiJhSu8KMm5SH-Ll8v/view","slides":"https://giorgia-nadizar.github.io/slides/JGEA","video":"","notes":"","code":"https://github.com/ericmedvet/jgea","poster":"","cite":"@inproceedings{medvet2022jgea,\n  title={JGEA: a modular java framework for experimenting with evolutionary computation},\n  author={Medvet, Eric and Nadizar, Giorgia and Manzoni, Luca},\n  booktitle={Proceedings of the genetic and evolutionary computation conference companion},\n  pages={2009--2018},\n  year={2022}\n}","abstract":"We present the Java General Evolutionary Algorithm (JGEA) framework, a modular Java framework for experimenting with Evolutionary Computation (EC). We designed JGEA to be (a) aimed at providing a general interface to potentially all Evolutionary Algorithms (EAs), yet (b) solid and easy to use for people who rely on EC as a tool. To this extent, we developed JGEA including a range of ready-to-use EAs, backed by a modular architecture, comprising diverse layers of abstraction, which simplifies the implementation of new EAs and the addition of new features. Here, we detail the general structure of JGEA, focusing on its high-level components, and present the use case of the introduction of a new EA in the framework. To complete the picture, we illustrate the application of JGEA for solving a real world problem, from its formal definition in the framework to the saving and processing of results. The source code of JGEA is available at <a href=\"https://github.com/ericmedvet/jgea\">https://github.com/ericmedvet/jgea</a>."},{"n":"06","id":"medvet2022impact","title":"On the Impact of Body Material Properties on Neuroevolution for Embodied Agents: the Case of Voxel-based Soft Robots","author":"E. Medvet, G. Nadizar, F. Pigozzi","venue":"Workshop on Neuroevolution at Work (NEWK@GECCO)","year":"2022","type":"conference","doi":"10.1145/3520304.3533967","full_text":"https://drive.google.com/file/d/1Y3dQGibLWLsFE50UcwP58AOH4b79vCnu/view","slides":"https://drive.google.com/file/d/1SuhqjgEJqNYOsPkMMwdFnLgoWBAPl9pj/view","video":"https://giorgia-nadizar.github.io/BodyParamsInfluenceOnNE/","notes":"","code":"https://github.com/giorgia-nadizar/BodyParamsInfluenceOnNE","poster":"","cite":"@inproceedings{medvet2022impact,\n  title={On the impact of body material properties on neuroevolution for embodied agents: the case of voxel-based soft robots},\n  author={Medvet, Eric and Nadizar, Giorgia and Pigozzi, Federico},\n  booktitle={Proceedings of the Genetic and Evolutionary Computation Conference Companion},\n  pages={2122--2130},\n  year={2022}\n}","abstract":"Artificial agents required to perform non-trivial tasks are commonly controlled with Artificial Neural Networks (ANNs), which need to be carefully fine-tuned. This is where ANN optimization comes into play, often in the form of Neuroevolution (NE). Among artificial agents, the <i>embodied</i> ones are characterized by a strong body-brain entanglement, i.e., a strong interdependence between the physical properties of the body and the controller. In this work, we aim at characterizing said interconnection, experimentally evaluating the impact body material properties have on NE for embodied agents. We consider the case of Voxel-based Soft Robots (VSRs), a class of simulated modular soft robots which achieve movement through the rhythmical contraction and expansion of their modules. We experiment varying several physical properties of VSRs and assess the effectiveness of the evolved controllers for the task of locomotion, together with their robustness and adaptability. Our results confirm the existence of a deep body-brain interrelationship for embodied agents, and highlight how NE fruitfully exploits the physical properties of the agents to give rise to a wide gamut of effective and adaptable behaviors."},{"n":"07","id":"furlan2022mutual","title":"On the Mutual Influence of Human and Artificial Life: an Experimental Investigation","author":"S. Furlan, E. Medvet, G. Nadizar, F. Pigozzi","venue":"Conference on Artificial Life (Alife)","year":"2022","type":"conference","doi":"10.1162/isal_a_00492","full_text":"https://drive.google.com/file/d/1PQUzf6eC2Kdn9R67NCbWw3bdr2uC4uBG/view","slides":"https://giorgia-nadizar.github.io/slides/HumanALifeMutualInfluence","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{furlan2022mutual,\n  title={On the Mutual Influence of Human and Artificial Life: an Experimental Investigation},\n  author={Furlan, Stefano and Medvet, Eric and Nadizar, Giorgia and Pigozzi, Federico},\n  booktitle={ALIFE 2022: The 2022 Conference on Artificial Life},\n  year={2022},\n  organization={MIT press}\n}","abstract":"Our modern world is teeming with non-biological agents, whose growing complexity brings them so close to living beings that they can be cataloged as artificial <i>creatures</i>, i.e., a form of Artificial Life (ALife). Ranging from disembodied intelligent agents to robots of conspicuous dimensions, all these artifacts are united by the fact that they are designed, built, and possibly trained by humans taking inspiration from natural elements. Hence, humans play a fundamental role in relation to ALife, both as creators and as final users, which calls attention to the need of studying the mutual influence of human and artificial life. Here we attempt an experimental investigation of the reciprocal effects of the human-ALife interaction. To this extent, we design an artificial world populated by life-like creatures, and resort to open-ended evolution to foster the creatures adaptation. We allow bidirectional communication between the system and humans, who can observe the artificial world and voluntarily choose to perform positive or negative actions towards the creatures populating it; those actions may have a short- or long-term impact on the artificial creatures. Our experimental results show that the creatures are capable of evolving under the influence of humans, even though the impact of the interaction remains uncertain. In addition, we find that ALife gives rise to disparate feelings in humans who interact with it, who are not always aware of the importance of their conduct."},{"n":"08","id":"nadizar2022p","title":"P Systems inference via Grammatical Evolution","author":"G. Nadizar, G. Pietropolli","venue":"23rd Conference on Membrane Computing","year":"2022","type":"conference","doi":"","full_text":"https://drive.google.com/file/d/11E9Srh4myYl5YvszJCy__lLKmKZZFTX7/view?usp=sharing","slides":"https://drive.google.com/file/d/1T52TuNgKtSJznhSfZKgI_EXK9zHq9ec-/view?usp=sharing","video":"","notes":"","code":"","poster":"","cite":"","abstract":"P systems are a bio-inspired framework for defining parallel models of computation. Despite their relevance for both theoretical and application scenarios, the design and synthesis of P systems remain a tedious and demanding task. In this work, we try to address this problem by proposing an automated design methodology based on Grammatical Evolution (GE)—an evolutionary computation technique. We consider a situation where observations of the steps of a P system are available, and we rely on GE for automatically inferring its structure, i.e., its rules."},{"n":"09","id":"nadizar2023effects","title":"On the Effects of Collaborators Selection and Aggregation in Cooperative Coevolution: an Experimental Analysis","author":"G. Nadizar, E. Medvet","venue":"26th European Conference on Genetic Programming (EuroGP)","year":"2023","type":"conference","doi":"10.1007/978-3-031-29573-7_19","full_text":"https://drive.google.com/file/d/1utQ5kCukMH61jR5f8evADBdl6L1CE8gD/view","slides":"","video":"","notes":"","code":"","poster":"https://drive.google.com/file/d/1-1SPyLVSgyT9m2Loqj_vCSwNLjZUjMYD/view","cite":"@inproceedings{nadizar2023effects,\n  title={On the Effects of Collaborators Selection and Aggregation in Cooperative Coevolution: An Experimental Analysis},\n  author={Nadizar, Giorgia and Medvet, Eric},\n  booktitle={Genetic Programming: 26th European Conference, EuroGP 2023, Held as Part of EvoStar 2023, Brno, Czech Republic, April 12--14, 2023, Proceedings},\n  pages={292--307},\n  year={2023},\n  organization={Springer}\n}","abstract":"Cooperative Coevolution is a way to solve complex optimization problems by dividing them in smaller, simpler sub-problems. Those sub-problems are then tackled concurrently by evolving one population of solutions—actually, <i>components</i> of a larger solution—for each of them. However, components cannot be evaluated in isolation: in the common case of two concurrently evolving populations, each solution of one population must be coupled with another solution of the other population (the <i>collaborator</i>) in order to compute the fitness of the pair. Previous studies have already shown that the way collaborators are chosen and, if more than one is chosen, the way the resulting fitness measures are aggregated, play a key role in determining the success of coevolution. In this paper we perform an experimental analysis aimed at shedding new light on the effects of collaborators selection and aggregation. We first propose a general scheme for cooperative coevolution of two populations that allows to (a) different EAs and solution representations on the two sub-problems and to (b) set different collaborators selection and aggregation strategies. Second, we instantiate this general scheme in a few variants and apply it to four optimization problems with different degrees of separability: two toy problems and two real prediction problems tackled with different kinds of model (symbolic regression and neural networks). We analyze the outcomes in terms of (a) effectiveness and efficiency of the optimization and (b) complexity and generalization power of the solutions. We find that the degree to which selection and aggregation schemes differ strongly depends on the interaction between the components of the solution."},{"n":"10","id":"nadizar2023investigation","title":"An Investigation of Geometric Semantic GP with Linear Scaling","author":"G. Nadizar, F. Garrow, B. Sakallioglu, L. Canonne, S. Silva, L. Vanneschi","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2023","type":"conference","doi":"","full_text":"https://drive.google.com/file/d/1-wudemZ9qlh2JuGdhdA_2DujtptIyR46/view","slides":"","video":"","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2023investigation,\n  title={An Investigation of Geometric Semantic GP with Linear Scaling},\n  author={Nadizar, Giorgia and Garrow, Fraser and Sakallioglu, Berfin and Canonne, Lorenzo and Silva, Sara and Vanneschi, Leonardo},\n  booktitle={Proceedings of the Genetic and Evolutionary Computation Conference},\n  year={2023}\n}","abstract":"Geometric semantic genetic programming (GSGP) and linear scaling (LS) have both, independently, shown the ability to outperform standard genetic programming (GP) for symbolic regression. GSGP uses geometric semantic genetic operators, different from the standard ones, without altering the fitness, while LS modifies the fitness without altering the genetic operators. So far, these two methods have already been joined together in only one practical application. However, to the best of our knowledge, a methodological study on the pros and cons of integrating these two methods has never been performed. In this paper, we present a study of GSGP-LS, a system that integrates GSGP and LS. The results, obtained on five hand-tailored benchmarks and six real-life problems, indicate that GSGP-LS outperforms GSGP in the majority of the cases, confirming the expected benefit of this integration. However, for some particularly hard datasets, GSGP-LS overfits training data, being outperformed by GSGP on unseen data. Additional experiments using standard GP, with and without LS, confirm this trend also when standard crossover and mutation are employed. This contradicts the idea that LS is always beneficial for GP, warning the practitioners about its risk of overfitting in some specific cases."},{"n":"11","id":"nadizar2023fully","title":"A Fully-distributed Shape-aware Neural Controller for Modular Robots","author":"G. Nadizar, E. Medvet, K. Walker, S. Risi","venue":"ACM Genetic and Evolutionary Computation Conference (GECCO)","year":"2023","type":"conference","doi":"","full_text":"https://drive.google.com/file/d/1qpA7IpTJS881gjvu0kYHmkr5XraCZB28/view","slides":"","video":"https://drive.google.com/drive/u/1/folders/12t2Wt07PzQCRFTkeEwCi4rK_71F9S650","notes":"","code":"","poster":"","cite":"@inproceedings{nadizar2023fully,\n  title={A Fully-distributed Shape-aware Neural Controller for Modular Robots},\n  author={Nadizar, Giorgia and Medvet, Eric and Walker, Kathryn and Risi, Sebastian},\n  booktitle={Proceedings of the Genetic and Evolutionary Computation Conference},\n  year={2023}\n}","abstract":"Modular robots are promising for their versatility and large design freedom. Modularity can also enable automatic assembly and reconfiguration, be it autonomous or via external machinery. However, these procedures are error-prone and often result in misassemblings. This, in turn, can cause catastrophic effects on the robot functionality, as the controller deployed in each module is optimized for a different robot shape than the actual one. In this work, we address such shortcoming by proposing a shape-aware modular controller, operating with (1) <i>self-discovery</i> phase, in which each module controller identifies the shape it is assembled in, followed by (2) <i>parameter selection</i> phase, where the controller selects its parameters according to the inferred shape. We deploy a self-classifying neural cellular automaton for phase (1), and we leverage evolutionary optimization for implementing a library of controller parameters for phase (2). We test the validity of the proposed method considering voxel-based soft robots, a class of modular soft robots, and the task of locomotion. Our findings confirm the effectiveness of such a controller paradigm, and also show that it can be used to partially overcome unforeseen damages or assembly mistakes."}]